espressif/arduino-esp32/libraries/I2S/src/I2S.cpp
  if(_driveClock == false){
    i2s_config.use_apll = true;
    i2s_config.fixed_mclk = 512*_sampleRate;
  }

  // Install and start i2s driver
  while(ESP_OK != esp_i2s::i2s_driver_install((esp_i2s::i2s_port_t) _deviceIndex, &i2s_config, _I2S_EVENT_QUEUE_LENGTH, &_i2sEventQueue)){
    // increase buffer size
    if(2*_i2s_dma_buffer_size <= 1024){
      log_w("(I2S#%d) WARNING i2s driver install failed.\nTrying to increase I2S DMA buffer size from %d to %d\n", _deviceIndex, _i2s_dma_buffer_size, 2*_i2s_dma_buffer_size);
      setBufferSize(2*_i2s_dma_buffer_size);
    }else if(_i2s_dma_buffer_size < 1024){
      log_w("(I2S#%d) WARNING i2s driver install failed.\nTrying to decrease I2S DMA buffer size from %d to 1024\n", _deviceIndex, _i2s_dma_buffer_size);
      setBufferSize(1024);
    }else{ // install failed with max buffer size
      log_e("(I2S#%d) ERROR i2s driver install failed", _deviceIndex);
      return 0; // ERR
    }
  } //try installing with increasing size

  if(_mode == I2S_RIGHT_JUSTIFIED_MODE || _mode == I2S_LEFT_JUSTIFIED_MODE || _mode == PDM_MONO_MODE){ // mono/single channel
    // Set the clock for MONO. Stereo is not supported yet.
    if(ESP_OK != esp_i2s::i2s_set_clk((esp_i2s::i2s_port_t) _deviceIndex, _sampleRate, (esp_i2s::i2s_bits_per_sample_t)_bitsPerSample, esp_i2s::I2S_CHANNEL_MONO)){
      log_e("(I2S#%d) Setting the I2S Clock has failed!\n", _deviceIndex);
      return 0; // ERR
    }
  } // mono channel mode

#if (SOC_I2S_SUPPORTS_ADC && SOC_I2S_SUPPORTS_DAC)
  if(_mode == ADC_DAC_MODE){
    esp_i2s::i2s_set_dac_mode(esp_i2s::I2S_DAC_CHANNEL_BOTH_EN);
    esp_i2s::adc_unit_t adc_unit;
    if(!_gpioToAdcUnit((gpio_num_t)_inSdPin, &adc_unit)){
      log_e("(I2S#%d) pin to adc unit conversion failed", _deviceIndex);
      return 0; // ERR
    }
    esp_i2s::adc_channel_t adc_channel;
    if(!_gpioToAdcChannel((gpio_num_t)_inSdPin, &adc_channel)){
      log_e("(I2S#%d) pin to adc channel conversion failed", _deviceIndex);
      return 0; // ERR
    }
    if(ESP_OK != esp_i2s::i2s_set_adc_mode(adc_unit, (esp_i2s::adc1_channel_t)adc_channel)){
      log_e("(I2S#%d) i2s_set_adc_mode failed", _deviceIndex);
      return 0; // ERR
    }
    if(ESP_OK != esp_i2s::i2s_set_pin((esp_i2s::i2s_port_t) _deviceIndex, NULL)){
      log_e("(I2S#%d) i2s_set_pin failed", _deviceIndex);
      return 0; // ERR
    }

    if(adc_unit == esp_i2s::ADC_UNIT_1){
      esp_i2s::adc1_config_width(esp_i2s::ADC_WIDTH_BIT_12);
      esp_i2s::adc1_config_channel_atten((esp_i2s::adc1_channel_t)adc_channel, esp_i2s::ADC_ATTEN_DB_11);
    }else if(adc_unit == esp_i2s::ADC_UNIT_2){
      esp_i2s::adc2_config_channel_atten((esp_i2s::adc2_channel_t)adc_channel, esp_i2s::ADC_ATTEN_DB_11);
    }

    esp_i2s::i2s_adc_enable((esp_i2s::i2s_port_t) _deviceIndex);
    _driverInstalled = true;
  }else // End of ADC/DAC mode
#endif // SOC_I2S_SUPPORTS_ADC_DAC
  if(_mode == I2S_PHILIPS_MODE || _mode == I2S_RIGHT_JUSTIFIED_MODE || _mode == I2S_LEFT_JUSTIFIED_MODE || _mode == PDM_STEREO_MODE || _mode == PDM_MONO_MODE){ // if I2S mode
    _driverInstalled = true; // IDF I2S driver must be installed before calling _applyPinSetting
    if(!_applyPinSetting()){
      log_e("(I2S#%d) could not apply pin setting during driver install", _deviceIndex);
      _uninstallDriver();
      return 0; // ERR
    }
  } // if I2S _mode
  return 1; // OK
}

// Init in MASTER mode: the SCK and FS pins are driven as outputs using the sample rate
int I2SClass::begin(int mode, int sampleRate, int bitsPerSample){
  if(!_take_mux()){ return 0; /* ERR */ }
  // master mode (driving clock and frame select pins - output)
  int ret = begin(mode, sampleRate, bitsPerSample, true);
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

// Init in SLAVE mode: the SCK and FS pins are inputs, other side controls sample rate
int I2SClass::begin(int mode, int bitsPerSample){
  if(!_take_mux()){ return 0; /* ERR */ }
  // slave mode (not driving clock and frame select pin - input)
  int ret = begin(mode, 96000, bitsPerSample, false);
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

// Core function
int I2SClass::begin(int mode, int sampleRate, int bitsPerSample, bool driveClock){
  if(!_take_mux()){ return 0; /* ERR */ }
  if(_initialized){
    log_e("(I2S#%d) ERROR: Object already initialized! Call I2S.end() to disable", _deviceIndex);
    if(!_give_mux()){ return 0; /* ERR */ }
    return 0; // ERR
  }
  _driveClock = driveClock;
  _mode = mode;
  _sampleRate = (uint32_t)sampleRate;

  _bitsPerSample = bitsPerSample;

  // There is work in progress on this library.
  if(_bitsPerSample == 16 && _sampleRate > 16000 && driveClock){
    log_w("(I2S#%d) The sample rate value %d is not officially supported - audio might be noisy.\nTry using sample rate below or equal to 16000", _deviceIndex, _sampleRate);
  }
  if(_bitsPerSample != 16){
    log_w("(I2S#%d) The %d bit-per-sample is not officially supported - audio quality might suffer.\nTry using 16bps, with sample rate below or equal 16000", _deviceIndex, _bitsPerSample);
  }
  if(_mode != I2S_PHILIPS_MODE){
    log_w("(I2S#%d) The mode %s is not officially supported - audio quality might suffer.\nAt the moment the only supported mode is I2S_PHILIPS_MODE", _deviceIndex, i2s_mode_text[_mode]);
  }

  if (_state != I2S_STATE_IDLE && _state != I2S_STATE_DUPLEX) {
    log_e("(I2S#%d) Error: unexpected _state (%d)", _deviceIndex, _state);
    if(!_give_mux()){ return 0; /* ERR */ }
    return 0; // ERR
  }

  switch (mode) {
    case I2S_PHILIPS_MODE:
    case I2S_RIGHT_JUSTIFIED_MODE:
    case I2S_LEFT_JUSTIFIED_MODE:
      break;

    #if (SOC_I2S_SUPPORTS_ADC && SOC_I2S_SUPPORTS_DAC)
      case ADC_DAC_MODE:
      break;
    #else
      log_e("(I2S#%d) ERROR: ADC/DAC is not supported on this SoC. Change mode or SoC", _deviceIndex);
     if(!_give_mux()){ return 0; /* ERR */ }
     return 0; // ERR
    #endif

#if defined(SOC_I2S_SUPPORTS_PDM_TX) || defined(SOC_I2S_SUPPORTS_PDM_RX)
    case PDM_STEREO_MODE:
    case PDM_MONO_MODE:
      break;
#else
    log_e("(I2S#%d) ERROR: PDM is not supported on this SoC. Change mode or SoC", _deviceIndex);
    if(!_give_mux()){ return 0; /* ERR */ }
    return 0; // ERR
#endif

    default: // invalid mode
      if(mode >= 0 && mode < MODE_MAX){
        log_e("(I2S#%d) ERROR: Mode '%s' is not supported on this SoC", _deviceIndex, i2s_mode_text[mode]);
      }else{
        log_e("(I2S#%d) ERROR: Mode %d is not recognized", _deviceIndex, mode);
      }
      if(!_give_mux()){ return 0; /* ERR */ }
      return 0; // ERR
  }
  if(!_installDriver()){
    log_e("(I2S#%d) ERROR: failed to install driver", _deviceIndex);
    end();
    if(!_give_mux()){ return 0; /* ERR */ }
    return 0; // ERR
  }

  _buffer_byte_size = _i2s_dma_buffer_size * (_bitsPerSample / 8) * _I2S_DMA_BUFFER_COUNT * 2;
  log_d("(I2S#%d) Creating internal buffers. Requested size = %dB\n", _deviceIndex, _buffer_byte_size);
  _input_ring_buffer  = xRingbufferCreate(_buffer_byte_size, RINGBUF_TYPE_BYTEBUF);
  _output_ring_buffer = xRingbufferCreate(_buffer_byte_size, RINGBUF_TYPE_BYTEBUF);
  if(_input_ring_buffer == NULL || _output_ring_buffer == NULL){
    log_e("(I2S#%d) ERROR: could not create one or both internal buffers. Requested size = %d\n", _deviceIndex, _buffer_byte_size);
    if(!_give_mux()){ return 0; /* ERR */ }
    return 0; // ERR
  }

