espressif/arduino-esp32/libraries/I2S/src/I2S.cpp
  if(_i2sEventQueue == NULL){
    log_e("(I2S#%d) Event Queue is NULL!", _deviceIndex);
  }else{
    while(true){
      xQueueReceive(_i2sEventQueue, &i2s_event, portMAX_DELAY);
      if(i2s_event.type == esp_i2s::I2S_EVENT_TX_DONE){
        _tx_done_routine(prev_item);
      }else if(i2s_event.type == esp_i2s::I2S_EVENT_RX_DONE){
        _rx_done_routine();
      } // RX Done
    } // infinite loop
  } // _i2sEventQueue NULL check
}

void I2SClass::onDmaTransferComplete(void *deviceIndex){
  uint8_t *index;
  index = (uint8_t*) deviceIndex;
  if(*index == 0){
    I2S._onTransferComplete();
  }
#if SOC_I2S_NUM > 1
  if(*index == 1){
    I2S1._onTransferComplete();
  }
#endif
  log_w("(I2S#%d) Deleting callback task from inside!", index);
  vTaskDelete(NULL);
}

inline bool I2SClass::_take_mux(){
  if(_i2s_general_mutex == NULL || xSemaphoreTakeRecursive(_i2s_general_mutex, portMAX_DELAY) != pdTRUE){
    log_e("(I2S#%d) Could not take semaphore %p", _deviceIndex, _i2s_general_mutex);
    return false;
  }
  return true;
}

inline bool I2SClass::_give_mux(){
  if(_i2s_general_mutex == NULL || xSemaphoreGiveRecursive(_i2s_general_mutex) != pdTRUE){
    log_e("(I2S#%d) Could not give semaphore %p", _deviceIndex, _i2s_general_mutex);
    return false;
  }
  return true;
}


// Fixes data in-situ received from esp i2s driver. After fixing they reflect what was on the bus.
// input - bytes as received from i2s_read - this serves as input and output buffer
// size - number of bytes (this may be changed during operation)
void I2SClass::_post_read_data_fix(void *input, size_t *size){
  ulong dst_ptr = 0;
  switch(_bitsPerSample){
    case 8:
      for(int i = 0; i < *size; i+=4){
        ((uint8_t*)input)[dst_ptr++] = ((uint8_t*)input)[i+3];
        ((uint8_t*)input)[dst_ptr++] = ((uint8_t*)input)[i+1];
      }
      *size /= 2;
    break;
    case 16:
      uint16_t tmp;
      for(int i = 0; i < *size/2; i+=2){
        tmp = ((uint16_t*)input)[i];
        ((uint16_t*)input)[dst_ptr++] = ((uint16_t*)input)[i+1];
        ((uint16_t*)input)[dst_ptr++] = tmp;
      }
      break;
    case 24:
        // TODO check if need fix and if so, implement it
      break;
      default: ;
        // Do nothing
  } // switch
}

// Prepares data and writes them to IDF i2s driver.
// This counters possible bug in ESP IDF I2S driver
// output - bytes to be sent
// size - number of bytes in original buffer
// bytes_written - number of bytes used from original buffer
// actual_bytes_written - number of bytes written by i2s_write after fix
void I2SClass::_fix_and_write(void *output, size_t size, size_t *bytes_written, size_t *actual_bytes_written){
  ulong src_ptr = 0;
  uint8_t* buff = NULL;
  size_t buff_size = size;
  uint32_t offset = 1; // 24bit specific
  switch(_bitsPerSample){
    case 8:
      buff_size = size *2;
      buff = (uint8_t*)calloc(buff_size, sizeof(uint8_t));
      if(buff == NULL){
        log_e("(I2S#%d) callock error", _deviceIndex);
        if(bytes_written != NULL){ *bytes_written = 0; }
        return;
      }
      for(int i = 0; i < buff_size ; i+=4){
        ((uint8_t*)buff)[i+3] = (uint16_t)((uint8_t*)output)[src_ptr++];
        ((uint8_t*)buff)[i+1] = (uint16_t)((uint8_t*)output)[src_ptr++];
      }
    break;
    case 16:
      buff = (uint8_t*)malloc(buff_size);
      if(buff == NULL){
        log_e("(I2S#%d) malloc error", _deviceIndex);
        if(bytes_written != NULL){ *bytes_written = 0; }
        return;
      }
      for(int i = 0; i < size/2; i += 2 ){
        ((uint16_t*)buff)[i]   = ((uint16_t*)output)[i+1]; // [1] <- [0]
        ((uint16_t*)buff)[i+1] = ((uint16_t*)output)[i]; // [0] <- [1]
      }
    break;
    case 24:
      buff_size = (size/3)*4; // Increase by 1/3
      buff = (uint8_t*)calloc(buff_size, sizeof(uint8_t));
      for(int i = 0; i < size/3; i+=3){
        // LSB in buffer's 4-Byte Word is 0 to compensate IDF driver behavior
        buff[i+offset] = ((uint8_t*)output)[i];
        buff[i+offset+1] = ((uint8_t*)output)[i+1];
        buff[i+offset+2] = ((uint8_t*)output)[i+2];
        ++offset;
      }
      break;
    case 32:
      buff = (uint8_t*)output;
      break;
    default:
      break; // Do nothing
  } // switch

  size_t _bytes_written;
  esp_err_t ret = esp_i2s::i2s_write((esp_i2s::i2s_port_t) _deviceIndex, buff, buff_size, &_bytes_written, 0); // fixed
  if(ret != ESP_OK){
    log_e("(I2S#%d) Error: writing data to i2s - function returned with err code %d", _deviceIndex, ret);
  }
  if(ret == ESP_OK && buff_size != _bytes_written){
    log_w("(I2S#%d) Warning: writing data to i2s - written %d B instead of requested %d B", _deviceIndex, _bytes_written, buff_size);
  }
  // free if the buffer was actually allocated
  if(_bitsPerSample == 8 || _bitsPerSample == 16){
    free(buff);
  }
  if(bytes_written != NULL){
    *bytes_written = _bitsPerSample == 8 ? _bytes_written/2 : _bytes_written;
  }
  if(actual_bytes_written != NULL){
    *actual_bytes_written = _bytes_written;
  }
}


#if (SOC_I2S_SUPPORTS_ADC && SOC_I2S_SUPPORTS_DAC)
int I2SClass::_gpioToAdcUnit(gpio_num_t gpio_num, esp_i2s::adc_unit_t* adc_unit){
  switch(gpio_num){
#if CONFIG_IDF_TARGET_ESP32
    // ADC 1
    case GPIO_NUM_36:
    case GPIO_NUM_37:
    case GPIO_NUM_38:
    case GPIO_NUM_39:
    case GPIO_NUM_32:
    case GPIO_NUM_33:
    case GPIO_NUM_34:
    case GPIO_NUM_35:
      *adc_unit = esp_i2s::ADC_UNIT_1;
      return 1; // OK

    // ADC 2
    case GPIO_NUM_0:
      log_w("(I2S#%d) GPIO 0 for ADC should not be used for dev boards due to external auto program circuits.", _deviceIndex);
    case GPIO_NUM_4:
    case GPIO_NUM_2:
    case GPIO_NUM_15:
    case GPIO_NUM_13:
    case GPIO_NUM_12:
    case GPIO_NUM_14:
    case GPIO_NUM_27:
    case GPIO_NUM_25:
    case GPIO_NUM_26:
      *adc_unit = esp_i2s::ADC_UNIT_2;
      return 1; // OK
#endif

#if (CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3)
    case GPIO_NUM_1:
    case GPIO_NUM_2:
    case GPIO_NUM_3:
    case GPIO_NUM_4:
    case GPIO_NUM_5:
    case GPIO_NUM_6:
    case GPIO_NUM_7:
    case GPIO_NUM_8:
    case GPIO_NUM_9:
    case GPIO_NUM_10:
      *adc_unit = esp_i2s::ADC_UNIT_1;
      return 1; // OK
#endif

#if CONFIG_IDF_TARGET_ESP32S2
    case GPIO_NUM_11:
    case GPIO_NUM_12:
    case GPIO_NUM_13:
    case GPIO_NUM_14:
    case GPIO_NUM_15:
    case GPIO_NUM_16:
    case GPIO_NUM_17:
    case GPIO_NUM_18:
    case GPIO_NUM_19:
    case GPIO_NUM_20:
      *adc_unit = esp_i2s::ADC_UNIT_2;
      return 1; // OK
#endif

